Tekla.Structures.ModelInternal.dotUIModelObjectSelector_t
Struct for UI selection

Tekla.Structures.ModelInternal.dotUIModelObjectSelector_t.Functionality
FunctionalityEnum

Tekla.Structures.ModelInternal.dotUIModelObjectSelector_t.nObjects
Number of objects

Tekla.Structures.ModelInternal.dotUIModelObjectSelector_t.aObjects
IDs

Tekla.Structures.ModelInternal.dotUIModelObjectSelector_t.ShowDimensions
ShowDimensions when selecting

Tekla.Structures.ModelInternal.dotUIModelObjectSelector_t.SuppressCallbacks
Suppress the callbacks